# Напишите функцию, которая принимает одно число и проверяет, является ли оно простым Напоминание: Простое число - это число, которое имеет 2 делителя: 1  и n(само число) Input: 5 Output: yes

import os
os.system("cls")

# ?????-------------------------------
# def is_simple(num, count):
#     is_simple(num, count-1)


# num = input("Введите число: ")
# res = "Простое"
# for i in range(2, int(num ** (0.5) +1 )):
#     if num % i == 0:
#         res = "Составное"
#         break
# print(res)



# n = int(input('Input number: '))

# def simple_num(num):
#     if num <= 1:
#         return 'no'
#     nums = [i for i in range(1,num)]
#     result = [i for i in nums if num % i == 0]
#     if len(result) >= 2:
#         return 'No'
#     else:
#         return 'Yes'

# print(simple_num(n))





